jelli123/IP-Interface-ESP32/src/hw_config.cpp
/*
 *  hw_config.cpp - Hardware profile, loaded at runtime.
 */

#include <Preferences.h>
#include <driver/gpio.h>
#include <nvs_flash.h>
#include <soc/soc_caps.h>

#include "hw_config.h"
#include "interface_config.h"
#include "json_util.h"

HwConfig hwConfig;

static Preferences prefs;

/** NVS namespace. Separate from the application settings on purpose. */
static const char* NS = "hwcfg";

/**
 * Layout marker for the button and LED lists.
 *
 * They are stored as raw structure arrays, so a change to any of those
 * structures makes the old bytes meaningless. Reading them anyway would hand
 * random GPIO numbers to pinMode(), which is a good deal worse than losing
 * the configuration: bump this and the lists fall back to the defaults.
 */
static const uint8_t IO_VERSION = 2;

/** Copy a name into a fixed field, always terminated. */
static void copyName(char* dst, const String& src)
{
    size_t n = src.length();
    if (n > HW_NAME_MAX) n = HW_NAME_MAX;
    memcpy(dst, src.c_str(), n);
    dst[n] = '\0';
}

/**
 * Uptime after which the profile counts as proven.
 *
 * Long enough to cover a crash during peripheral setup and the first KNX
 * traffic, short enough that a user power-cycling the device twice in a row
 * does not trip the crash-loop detection.
 */
static const uint32_t PROVEN_AFTER_MS = 20000UL;

/** Boot attempts with an unproven profile before falling back. */
static const uint8_t MAX_BOOT_ATTEMPTS = 2;

/* Fallbacks in case a future core drops the macros. */
#ifndef GPIO_IS_VALID_GPIO
#define GPIO_IS_VALID_GPIO(n) ((n) >= 0 && (n) < SOC_GPIO_PIN_COUNT)
#endif
#ifndef GPIO_IS_VALID_OUTPUT_GPIO
#define GPIO_IS_VALID_OUTPUT_GPIO(n) GPIO_IS_VALID_GPIO(n)
#endif

/* ------------------------------------------------------------------------- *
 * Lookups
 * ------------------------------------------------------------------------- */

int8_t HwProfile::findLed(const char* name) const
{
    for (uint8_t i = 0; i < ledCount && i < HW_MAX_LEDS; i++)
    {
        if (strncmp(leds[i].name, name, HW_NAME_MAX + 1) == 0) return (int8_t)i;
    }
    return -1;
}

int8_t HwProfile::findButton(const char* name) const
{
    for (uint8_t i = 0; i < buttonCount && i < HW_MAX_BUTTONS; i++)
    {
        if (strncmp(buttons[i].name, name, HW_NAME_MAX + 1) == 0) return (int8_t)i;
    }
    return -1;
}

bool HwProfile::usesCondition(uint8_t condition) const
{
    for (uint8_t i = 0; i < ledAssignCount && i < HW_MAX_LED_ASSIGN; i++)
    {
        if (ledAssign[i].condition == condition && findLed(ledAssign[i].target) >= 0)
        {
            return true;
        }
    }
    return false;
}

int8_t HwProfile::findButtonFor(uint8_t function) const
{
    for (uint8_t i = 0; i < btnAssignCount && i < HW_MAX_BTN_ASSIGN; i++)
    {
        if (btnAssign[i].function == function)
        {
            int8_t at = findButton(btnAssign[i].target);
            if (at >= 0) return at;
        }
    }
    return -1;
}

/* ------------------------------------------------------------------------- *
 * Defaults
 * ------------------------------------------------------------------------- */

HwProfile HwConfig::defaults()
{
    HwProfile p;

    p.knxUartNum   = SBIP_KNX_UART_NUM;
    p.knxRxPin     = SBIP_KNX_RX_PIN;
    p.knxTxPin     = SBIP_KNX_TX_PIN;

    /*
     * The image ships with the layout the reference board has. Everything
     * here is a starting point the dashboard can replace.
     */
#if SBIP_LED_PIN >= 0
    {
        HwLed& led = p.leds[p.ledCount++];
        copyName(led.name, "prog");
        led.pin       = SBIP_LED_PIN;
        led.kind      = HW_LED_PLAIN;
        led.activeLow = (SBIP_LED_ACTIVE_LOW != 0);
    }
#endif

#if SBIP_RGB_PIN >= 0
    {
        HwLed& led = p.leds[p.ledCount++];
        copyName(led.name, "rgb");
        led.pin      = SBIP_RGB_PIN;
        led.kind     = HW_LED_RGB;
        led.rgbType  = SBIP_RGB_TYPE;
        led.rgbIndex = 0;
    }
#endif

    /*
     * One LED shows everything, in falling priority. On a board whose only
     * indicator is the RGB LED this is the whole user interface, so it has to
     * carry the programming mode as well - that is the one signal a KNX
     * installer actually needs while standing at the device.
     */
    if (p.ledCount > 0)
    {
        const char* first = p.leds[0].name;
        const char* last  = p.leds[p.ledCount - 1].name;

        struct Row
        {
            const char* target;
            uint8_t     condition;
            uint8_t     colour;
            uint8_t     pattern;
        };

        const Row rows[] = {
            { first, HW_COND_PROG_MODE, HW_COL_RED,    HW_PAT_BLINK_SLOW },
            { last,  HW_COND_AP_MODE,   HW_COL_BLUE,   HW_PAT_DOUBLE     },
            { last,  HW_COND_TP_DOWN,   HW_COL_YELLOW, HW_PAT_BLINK_FAST },
            { last,  HW_COND_ONLINE,    HW_COL_GREEN,  HW_PAT_STEADY     },
            { last,  HW_COND_HEARTBEAT, HW_COL_WHITE,  HW_PAT_FLASH      },
        };

        for (size_t i = 0; i < sizeof(rows) / sizeof(rows[0]); i++)
        {
            HwLedAssignment& a = p.ledAssign[p.ledAssignCount++];
            copyName(a.target, rows[i].target);
            a.condition = rows[i].condition;
            a.colour    = rows[i].colour;
            a.pattern   = rows[i].pattern;
        }
    }

#if SBIP_BUTTON_PIN >= 0
    {
        // Two rows on one pin: a short press toggles the programming mode,
        // holding it opens the provisioning access point. That is exactly
        // what the firmware did before the lists existed.
        HwButton& shortPress = p.buttons[p.buttonCount++];
        copyName(shortPress.name, "prog");
        shortPress.pin     = SBIP_BUTTON_PIN;
        shortPress.trigger = HW_PRESS_SHORT;

        HwButton& longPress = p.buttons[p.buttonCount++];
        copyName(longPress.name, "setup");
        longPress.pin     = SBIP_BUTTON_PIN;
        longPress.trigger = HW_PRESS_LONG;

        HwAssignment& a1 = p.btnAssign[p.btnAssignCount++];
        copyName(a1.target, "prog");
        a1.function = HW_BTNF_PROG_MODE;

        HwAssignment& a2 = p.btnAssign[p.btnAssignCount++];
        copyName(a2.target, "setup");
        a2.function = HW_BTNF_WIFI_SETUP;
    }
#endif

