jelli123/IP-Interface-ESP32/src/hw_config.cpp
    p.i2cEnabled   = (SBIP_I2C_ENABLED != 0) && (SBIP_I2C_SDA_PIN >= 0);
    p.i2cSdaPin    = SBIP_I2C_SDA_PIN;
    p.i2cSclPin    = SBIP_I2C_SCL_PIN;

    p.ethSckPin    = SBIP_ETH_SCK_PIN;
    p.ethMisoPin   = SBIP_ETH_MISO_PIN;
    p.ethMosiPin   = SBIP_ETH_MOSI_PIN;
    p.ethCsPin     = SBIP_ETH_CS_PIN;
    p.ethIrqPin    = SBIP_ETH_IRQ_PIN;
    p.ethRstPin    = SBIP_ETH_RST_PIN;
    p.ethSpiMhz    = SBIP_ETH_SPI_MHZ;
    p.ethEnabled   = (p.ethCsPin >= 0) && (p.ethSckPin >= 0) &&
                     (p.ethMisoPin >= 0) && (p.ethMosiPin >= 0);

    return p;
}

/* ------------------------------------------------------------------------- *
 * Validation
 * ------------------------------------------------------------------------- */

/*
 * Pins wired to the SPI flash (and, where applicable, PSRAM).
 *
 * These are inside the chip's valid GPIO mask, so GPIO_IS_VALID_GPIO() does
 * not catch them - but driving one kills the running firmware instantly.
 * That is exactly the mistake a hand-written profile can make, so it is
 * checked explicitly rather than left to the user.
 */
bool HwConfig::pinIsFlash(int8_t pin)
{
    if (pin < 0)
    {
        return false;
    }

#if CONFIG_IDF_TARGET_ESP32
    if (pin >= 6 && pin <= 11) return true;
#if CONFIG_SPIRAM
    // WROVER modules route PSRAM over GPIO 16/17; WROOM leaves them free.
    if (pin == 16 || pin == 17) return true;
#endif
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
    // Quad flash/PSRAM. Octal variants additionally use 33..37, which cannot
    // be detected here - check the module datasheet before using them.
    if (pin >= 26 && pin <= 32) return true;
#elif CONFIG_IDF_TARGET_ESP32C3
    if (pin >= 11 && pin <= 17) return true;
#elif CONFIG_IDF_TARGET_ESP32C6
    if (pin >= 24 && pin <= 30) return true;
#endif

    return false;
}

bool HwConfig::pinUsable(int8_t pin, bool needsOutput)
{
    if (pin < 0)
    {
        return true; // not fitted
    }
    if (!GPIO_IS_VALID_GPIO(pin))
    {
        return false;
    }
    if (needsOutput && !GPIO_IS_VALID_OUTPUT_GPIO(pin))
    {
        return false;
    }
    return !pinIsFlash(pin);
}

bool HwConfig::nameValid(const char* name)
{
    if (name == nullptr) return false;

    size_t n = strnlen(name, HW_NAME_MAX + 1);
    if (n == 0 || n > HW_NAME_MAX) return false;

    for (size_t i = 0; i < n; i++)
    {
        char c = name[i];
        bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                  (c >= '0' && c <= '9') || c == '_' || c == '-';
        if (!ok) return false;
    }
    return true;
}

bool HwConfig::validate(const HwProfile& p, String& error)
{
    struct Entry
    {
        const char* name;
        int8_t      pin;
        bool        output;
        bool        required;
    };

    if (p.buttonCount > HW_MAX_BUTTONS || p.ledCount > HW_MAX_LEDS ||
        p.btnAssignCount > HW_MAX_BTN_ASSIGN || p.ledAssignCount > HW_MAX_LED_ASSIGN)
    {
        error = "too many rows";
        return false;
    }

    /* --- buttons ------------------------------------------------------- */

    for (uint8_t i = 0; i < p.buttonCount; i++)
    {
        const HwButton& b = p.buttons[i];

        if (!nameValid(b.name))
        {
            error = "button name must be 1.." + String(HW_NAME_MAX) +
                    " characters from A-Z a-z 0-9 _ -";
            return false;
        }
        if (b.trigger >= HW_PRESS_COUNT)
        {
            error = String("button ") + b.name + ": unknown trigger";
            return false;
        }
        if (b.pin < 0)
        {
            error = String("button ") + b.name + ": no GPIO selected";
            return false;
        }
        if (!GPIO_IS_VALID_GPIO(b.pin))
        {
            error = String("button ") + b.name + ": GPIO " + String(b.pin) +
                    " does not exist on this chip";
            return false;
        }
        if (pinIsFlash(b.pin))
        {
            error = String("button ") + b.name + ": GPIO " + String(b.pin) +
                    " is wired to the SPI flash";
            return false;
        }

        for (uint8_t j = i + 1; j < p.buttonCount; j++)
        {
            if (strncmp(b.name, p.buttons[j].name, HW_NAME_MAX + 1) == 0)
            {
                error = String("button name ") + b.name + " is used twice";
                return false;
            }
            // One pin may carry several rows, which is how a short press and
            // a long press on the same button end up doing different things.
            // The same trigger twice is always a mistake.
            if (b.pin == p.buttons[j].pin && b.trigger == p.buttons[j].trigger)
            {
                error = String("buttons ") + b.name + " and " + p.buttons[j].name +
                        " share GPIO " + String(b.pin) + " and the same trigger";
                return false;
            }
        }
    }

    /* --- LEDs ---------------------------------------------------------- */

    for (uint8_t i = 0; i < p.ledCount; i++)
    {
        const HwLed& l = p.leds[i];

        if (!nameValid(l.name))
        {
            error = "LED name must be 1.." + String(HW_NAME_MAX) +
                    " characters from A-Z a-z 0-9 _ -";
            return false;
        }
        if (l.kind >= HW_LED_KIND_COUNT)
        {
            error = String("LED ") + l.name + ": unknown type";
            return false;
        }
        if (l.pin < 0)
        {
            error = String("LED ") + l.name + ": no GPIO selected";
            return false;
        }
        if (!GPIO_IS_VALID_GPIO(l.pin))
        {
            error = String("LED ") + l.name + ": GPIO " + String(l.pin) +
                    " does not exist on this chip";
            return false;
        }
        if (pinIsFlash(l.pin))
        {
            error = String("LED ") + l.name + ": GPIO " + String(l.pin) +
                    " is wired to the SPI flash";
            return false;
        }
        if (!GPIO_IS_VALID_OUTPUT_GPIO(l.pin))
        {
            error = String("LED ") + l.name + ": GPIO " + String(l.pin) +
                    " is input only";
            return false;
        }
        if (l.kind == HW_LED_RGB)
        {
            if (l.rgbType >= HW_RGB_TYPE_COUNT)
            {
                error = String("LED ") + l.name + ": unknown chip type";
                return false;
            }
            if (l.rgbIndex >= 64)
            {
                error = String("LED ") + l.name + ": position must be 0..63";
                return false;
            }
        }

        for (uint8_t j = i + 1; j < p.ledCount; j++)
        {
            const HwLed& o = p.leds[j];

