jelli123/IP-Interface-ESP32/src/hw_config.cpp
            if (strncmp(l.name, o.name, HW_NAME_MAX + 1) == 0)
            {
                error = String("LED name ") + l.name + " is used twice";
                return false;
            }
            if (l.pin != o.pin)
            {
                continue;
            }

            // Sharing a pin only makes sense for two positions on one
            // addressable chain - and then both rows describe the same
            // physical wire, so the chip type has to agree.
            if (l.kind != HW_LED_RGB || o.kind != HW_LED_RGB)
            {
                error = String("LEDs ") + l.name + " and " + o.name +
                        " share GPIO " + String(l.pin);
                return false;
            }
            if (l.rgbType != o.rgbType)
            {
                error = String("LEDs ") + l.name + " and " + o.name +
                        " are on one chain but have different chip types";
                return false;
            }
            if (l.rgbIndex == o.rgbIndex)
            {
                error = String("LEDs ") + l.name + " and " + o.name +
                        " use position " + String(l.rgbIndex) + " of the same chain";
                return false;
            }
        }
    }

    /* --- assignments --------------------------------------------------- */

    for (uint8_t i = 0; i < p.btnAssignCount; i++)
    {
        const HwAssignment& a = p.btnAssign[i];

        if (a.function >= HW_BTNF_COUNT)
        {
            error = "unknown button function";
            return false;
        }
        if (!nameValid(a.target) || p.findButton(a.target) < 0)
        {
            error = String("button assignment refers to unknown button");
            return false;
        }
        for (uint8_t j = i + 1; j < p.btnAssignCount; j++)
        {
            if (strncmp(a.target, p.btnAssign[j].target, HW_NAME_MAX + 1) == 0)
            {
                error = String("button ") + a.target + " has more than one function";
                return false;
            }
        }
    }

    for (uint8_t i = 0; i < p.ledAssignCount; i++)
    {
        const HwLedAssignment& a = p.ledAssign[i];

        if (a.condition >= HW_COND_COUNT)
        {
            error = "unknown LED state";
            return false;
        }
        if (a.colour >= HW_COL_COUNT)
        {
            error = "unknown LED colour";
            return false;
        }
        if (a.pattern >= HW_PAT_COUNT)
        {
            error = "unknown LED pattern";
            return false;
        }
        if (!nameValid(a.target) || p.findLed(a.target) < 0)
        {
            error = String("LED assignment refers to unknown LED");
            return false;
        }

        // Several states per LED are the point of the list, but the same
        // state twice on one LED means the lower row can never be reached.
        for (uint8_t j = i + 1; j < p.ledAssignCount; j++)
        {
            if (a.condition == p.ledAssign[j].condition &&
                strncmp(a.target, p.ledAssign[j].target, HW_NAME_MAX + 1) == 0)
            {
                error = String("LED ") + a.target + " has the same state twice";
                return false;
            }
        }
    }

    /* --- fixed peripherals, plus every pin claimed above ---------------- */

    Entry  entries[11 + HW_MAX_BUTTONS + HW_MAX_LEDS];
    size_t count = 0;

    entries[count++] = { "knx_rx",   p.knxRxPin,   false, true  };
    entries[count++] = { "knx_tx",   p.knxTxPin,   true,  true  };
    entries[count++] = { "i2c_sda",  p.i2cEnabled ? p.i2cSdaPin : (int8_t)-1, true, p.i2cEnabled };
    entries[count++] = { "i2c_scl",  p.i2cEnabled ? p.i2cSclPin : (int8_t)-1, true, p.i2cEnabled };
    entries[count++] = { "eth_sck",  p.ethEnabled ? p.ethSckPin  : (int8_t)-1, true, p.ethEnabled };
    entries[count++] = { "eth_miso", p.ethEnabled ? p.ethMisoPin : (int8_t)-1, false, p.ethEnabled };
    entries[count++] = { "eth_mosi", p.ethEnabled ? p.ethMosiPin : (int8_t)-1, true, p.ethEnabled };
    entries[count++] = { "eth_cs",   p.ethEnabled ? p.ethCsPin   : (int8_t)-1, true, p.ethEnabled };
    entries[count++] = { "eth_irq",  p.ethEnabled ? p.ethIrqPin  : (int8_t)-1, false, false };
    entries[count++] = { "eth_rst",  p.ethEnabled ? p.ethRstPin  : (int8_t)-1, true,  false };

    // One entry per distinct pin: the rows themselves were already checked
    // against each other, so only cross-group collisions are left to find.
    for (uint8_t i = 0; i < p.buttonCount; i++)
    {
        bool seen = false;
        for (uint8_t j = 0; j < i; j++)
        {
            if (p.buttons[j].pin == p.buttons[i].pin) seen = true;
        }
        if (!seen) entries[count++] = { p.buttons[i].name, p.buttons[i].pin, false, false };
    }
    for (uint8_t i = 0; i < p.ledCount; i++)
    {
        bool seen = false;
        for (uint8_t j = 0; j < i; j++)
        {
            if (p.leds[j].pin == p.leds[i].pin) seen = true;
        }
        if (!seen) entries[count++] = { p.leds[i].name, p.leds[i].pin, true, false };
    }

    if (p.knxUartNum < 0 || p.knxUartNum >= SOC_UART_NUM)
    {
        error = String("knx_uart out of range (0..") + String(SOC_UART_NUM - 1) + ")";
        return false;
    }

    for (size_t i = 0; i < count; i++)
    {
        const Entry& e = entries[i];

        if (e.required && e.pin < 0)
        {
            error = String(e.name) + " is required but not set";
            return false;
        }
        if (e.pin < 0)
        {
            continue;
        }
        if (!GPIO_IS_VALID_GPIO(e.pin))
        {
            error = String(e.name) + ": GPIO " + String(e.pin) + " does not exist on this chip";
            return false;
        }
        if (pinIsFlash(e.pin))
        {
            error = String(e.name) + ": GPIO " + String(e.pin) + " is wired to the SPI flash";
            return false;
        }
        if (e.output && !GPIO_IS_VALID_OUTPUT_GPIO(e.pin))
        {
            error = String(e.name) + ": GPIO " + String(e.pin) + " is input only";
            return false;
        }
    }

