jelli123/IP-Interface-ESP32/src/hw_config.cpp
    // Every pin may be claimed once. A duplicate is always a mistake and
    // usually a silent one - two peripherals fighting over a pin produces
    // symptoms far away from the cause.
    for (size_t i = 0; i < count; i++)
    {
        if (entries[i].pin < 0) continue;
        for (size_t j = i + 1; j < count; j++)
        {
            if (entries[i].pin == entries[j].pin)
            {
                error = String("GPIO ") + String(entries[i].pin) + " used by both " +
                        entries[i].name + " and " + entries[j].name;
                return false;
            }
        }
    }

    if (p.ethEnabled && (p.ethSpiMhz < 1 || p.ethSpiMhz > 80))
    {
        error = "eth_spi_mhz out of range (1..80)";
        return false;
    }

    error = "";
    return true;
}

/* ------------------------------------------------------------------------- *
 * Persistence
 *
 * The profile is stored as individual NVS keys, not as the JSON document.
 * JSON is only the transport format for the dashboard: parsing happens once,
 * while the value is being accepted, never on the boot path. A truncated or
 * corrupted blob can therefore not stop the device from starting.
 * ------------------------------------------------------------------------- */

void HwConfig::load()
{
    HwProfile d = defaults();

    prefs.begin(NS, true);
    _hasStored = prefs.getBool("set", false);

    if (_hasStored)
    {
        _stored.knxUartNum   = prefs.getChar("uart", d.knxUartNum);
        _stored.knxRxPin     = prefs.getChar("krx",  d.knxRxPin);
        _stored.knxTxPin     = prefs.getChar("ktx",  d.knxTxPin);
        _stored.i2cEnabled   = prefs.getBool("i2cen", d.i2cEnabled);
        _stored.i2cSdaPin    = prefs.getChar("sda",  d.i2cSdaPin);
        _stored.i2cSclPin    = prefs.getChar("scl",  d.i2cSclPin);
        _stored.ethEnabled   = prefs.getBool("ethen", d.ethEnabled);
        _stored.ethSckPin    = prefs.getChar("esck", d.ethSckPin);
        _stored.ethMisoPin   = prefs.getChar("emiso", d.ethMisoPin);
        _stored.ethMosiPin   = prefs.getChar("emosi", d.ethMosiPin);
        _stored.ethCsPin     = prefs.getChar("ecs",  d.ethCsPin);
        _stored.ethIrqPin    = prefs.getChar("eirq", d.ethIrqPin);
        _stored.ethRstPin    = prefs.getChar("erst", d.ethRstPin);
        _stored.ethSpiMhz    = (uint8_t)prefs.getUChar("emhz", d.ethSpiMhz);
        loadLists(d);
    }
    else
    {
        _stored = d;
    }

    prefs.end();
}

/*
 * The four lists are stored as raw structure arrays.
 *
 * Every blob has to be exactly the size this build expects and the layout
 * marker has to match, otherwise the whole set is discarded. Half a list is
 * worse than none: the counts and the arrays would disagree, and the result
 * would be a pin number taken from whatever happened to be in flash.
 *
 * Reads happen on the boot path, so this must not be able to fail loudly.
 * It falls back to @p d and says so.
 */
void HwConfig::loadLists(const HwProfile& d)
{
    struct Blob
    {
        const char* key;
        void*       dst;
        size_t      size;
        uint8_t*    count;
        const char* countKey;
        uint8_t     max;
    };

    const Blob blobs[] = {
        { "btns", _stored.buttons,   sizeof(_stored.buttons),   &_stored.buttonCount,    "btnc", HW_MAX_BUTTONS },
        { "leds", _stored.leds,      sizeof(_stored.leds),      &_stored.ledCount,       "ledc", HW_MAX_LEDS    },
        { "bact", _stored.btnAssign, sizeof(_stored.btnAssign), &_stored.btnAssignCount, "bacc", HW_MAX_BTN_ASSIGN },
        { "lact", _stored.ledAssign, sizeof(_stored.ledAssign), &_stored.ledAssignCount, "lacc", HW_MAX_LED_ASSIGN },
    };

    bool ok = (prefs.getUChar("iover", 0) == IO_VERSION);

    for (size_t i = 0; ok && i < sizeof(blobs) / sizeof(blobs[0]); i++)
    {
        ok = (prefs.getBytesLength(blobs[i].key) == blobs[i].size);
    }

    if (!ok)
    {
        Serial.println("HW: button/LED lists have a foreign layout - using defaults");
        _stored.buttonCount    = d.buttonCount;
        _stored.ledCount       = d.ledCount;
        _stored.btnAssignCount = d.btnAssignCount;
        _stored.ledAssignCount = d.ledAssignCount;
        memcpy(_stored.buttons,   d.buttons,   sizeof(d.buttons));
        memcpy(_stored.leds,      d.leds,      sizeof(d.leds));
        memcpy(_stored.btnAssign, d.btnAssign, sizeof(d.btnAssign));
        memcpy(_stored.ledAssign, d.ledAssign, sizeof(d.ledAssign));
        return;
    }

    for (size_t i = 0; i < sizeof(blobs) / sizeof(blobs[0]); i++)
    {
        prefs.getBytes(blobs[i].key, blobs[i].dst, blobs[i].size);

        uint8_t n = prefs.getUChar(blobs[i].countKey, 0);
        *blobs[i].count = (n > blobs[i].max) ? blobs[i].max : n;
    }

    // Names come straight out of flash, so nothing guarantees they are
    // terminated. Everything downstream treats them as C strings.
    for (uint8_t i = 0; i < HW_MAX_BUTTONS; i++)
        _stored.buttons[i].name[HW_NAME_MAX] = '\0';
    for (uint8_t i = 0; i < HW_MAX_LEDS; i++)
        _stored.leds[i].name[HW_NAME_MAX] = '\0';
    for (uint8_t i = 0; i < HW_MAX_BTN_ASSIGN; i++)
        _stored.btnAssign[i].target[HW_NAME_MAX] = '\0';
    for (uint8_t i = 0; i < HW_MAX_LED_ASSIGN; i++)
        _stored.ledAssign[i].target[HW_NAME_MAX] = '\0';
}

void HwConfig::store(const HwProfile& p)
{
    prefs.begin(NS, false);
    prefs.putChar("uart", p.knxUartNum);
    prefs.putChar("krx",  p.knxRxPin);
    prefs.putChar("ktx",  p.knxTxPin);
    prefs.putBool("i2cen", p.i2cEnabled);
    prefs.putChar("sda",  p.i2cSdaPin);
    prefs.putChar("scl",  p.i2cSclPin);
    prefs.putBool("ethen", p.ethEnabled);
    prefs.putChar("esck", p.ethSckPin);
    prefs.putChar("emiso", p.ethMisoPin);
    prefs.putChar("emosi", p.ethMosiPin);
    prefs.putChar("ecs",  p.ethCsPin);
    prefs.putChar("eirq", p.ethIrqPin);
    prefs.putChar("erst", p.ethRstPin);
    prefs.putUChar("emhz", p.ethSpiMhz);

    prefs.putBytes("btns", p.buttons,   sizeof(p.buttons));
    prefs.putBytes("leds", p.leds,      sizeof(p.leds));
    prefs.putBytes("bact", p.btnAssign, sizeof(p.btnAssign));
    prefs.putBytes("lact", p.ledAssign, sizeof(p.ledAssign));
    prefs.putUChar("btnc", p.buttonCount);
    prefs.putUChar("ledc", p.ledCount);
    prefs.putUChar("bacc", p.btnAssignCount);
    prefs.putUChar("lacc", p.ledAssignCount);
    prefs.putUChar("iover", IO_VERSION);

    prefs.putBool("set", true);
    prefs.putUChar("boots", 0); // a fresh profile starts unproven
    prefs.end();

    _stored        = p;
    _hasStored     = true;
    _rebootPending = true;
}

