jelli123/IP-Interface-ESP32/src/hw_config.cpp
/* ------------------------------------------------------------------------- *
 * Startup
 * ------------------------------------------------------------------------- */

void HwConfig::begin()
{
    // NVS carries the hardware profile and the WiFi credentials, so it has to
    // be up before anything else. A layout change leaves it unusable until
    // erased.
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        Serial.println("NVS: erasing and re-initialising");
        nvs_flash_erase();
        err = nvs_flash_init();
    }
    Serial.printf("NVS init: %s\n", err == ESP_OK ? "OK" : "FAILED");

    HwProfile d = defaults();
    load();

    if (!_hasStored)
    {
        _active   = d;
        _fallback = FB_UNCONFIGURED;
        Serial.println("HW: using built-in defaults (nothing stored)");
        return;
    }

    /*
     * Crash-loop guard.
     *
     * store() resets the counter, every boot increments it, and loop() clears
     * it once the firmware has run for PROVEN_AFTER_MS. A profile that keeps
     * crashing before that therefore counts up and is dropped - the same
     * pattern the OTA rollback uses, and the reason a bad pin assignment
     * cannot brick the device.
     *
     * This is the only automatic way back. Holding a button during startup
     * cannot be one: the button every DevKit has is the boot strapping pin
     * (GPIO 0 on ESP32/S2/S3, GPIO 9 on C3/C6), and holding it across reset
     * puts the ROM into serial download mode instead of starting the
     * application. At runtime the factory reset function does the job.
     */
    prefs.begin(NS, false);
    uint8_t attempts = prefs.getUChar("boots", 0);
    if (attempts >= MAX_BOOT_ATTEMPTS)
    {
        prefs.putBool("set", false);
        prefs.putUChar("boots", 0);
        prefs.end();

        _active    = d;
        _hasStored = false;
        _fallback  = FB_CRASHLOOP;
        Serial.printf("HW: stored profile failed %u boots - reverted to defaults\n",
                      attempts);
        return;
    }
    prefs.putUChar("boots", (uint8_t)(attempts + 1));
    prefs.end();

    String error;
    if (!validate(_stored, error))
    {
        _active   = d;
        _fallback = FB_INVALID;
        Serial.printf("HW: stored profile rejected (%s) - using defaults\n", error.c_str());
        return;
    }

    _active   = _stored;
    _fallback = FB_NONE;
    Serial.printf("HW: stored profile active (KNX UART%d rx=%d tx=%d)\n",
                  _active.knxUartNum, _active.knxRxPin, _active.knxTxPin);
}

void HwConfig::loop()
{
    if (_counterCleared || millis() < PROVEN_AFTER_MS)
    {
        return;
    }
    _counterCleared = true;

    if (!_hasStored)
    {
        return;
    }

    prefs.begin(NS, false);
    if (prefs.getUChar("boots", 0) != 0)
    {
        prefs.putUChar("boots", 0);
        Serial.println("HW: profile proven, crash-loop counter cleared");
    }
    prefs.end();
}

void HwConfig::resetToDefaults()
{
    prefs.begin(NS, false);
    prefs.clear();
    prefs.end();

    _hasStored     = false;
    _stored        = defaults();
    _rebootPending = true;
    Serial.println("HW: stored profile cleared, defaults active after reboot");
}

const char* HwConfig::fallbackReason() const
{
    switch (_fallback)
    {
    case FB_NONE:         return "";
    case FB_UNCONFIGURED: return "unconfigured";
    case FB_INVALID:      return "invalid";
    case FB_CRASHLOOP:    return "crashloop";
    }
    return "";
}

/* ------------------------------------------------------------------------- *
 * JSON
 * ------------------------------------------------------------------------- */

/*
 * Read one list.
 *
 * A missing key keeps whatever the patch started from; a present key replaces
 * the list completely. Replacing rather than merging is what makes deleting
 * the last row possible at all.
 *
 * @return false when the array is malformed or longer than @p max
 */
template <typename T, typename Fill>
static bool readList(const String& json, const char* key, uint8_t max,
                     uint8_t& count, T* items, Fill fill, String& error)
{
    if (!jsonHasKey(json, key))
    {
        return true;
    }

    String body;
    if (!jsonGetArray(json, key, body))
    {
        error = String(key) + ": malformed array";
        return false;
    }

    String  elements[16];
    uint8_t found = 0;

    if (!jsonSplitObjects(body, elements, 16, found))
    {
        error = String(key) + ": malformed array";
        return false;
    }
    if (found > max)
    {
        error = String(key) + ": at most " + String(max) + " rows";
        return false;
    }

    for (uint8_t i = 0; i < found; i++)
    {
        items[i] = T();
        fill(items[i], elements[i]);
    }
    count = found;
    return true;
}

bool HwConfig::applyJson(const String& json, String& error)
{
    // Start from what is running, so a partial document acts as a patch.
    HwProfile p = _active;

    p.knxUartNum   = (int8_t)jsonGetInt(json, "knx_uart", p.knxUartNum);
    p.knxRxPin     = (int8_t)jsonGetInt(json, "knx_rx",   p.knxRxPin);
    p.knxTxPin     = (int8_t)jsonGetInt(json, "knx_tx",   p.knxTxPin);

    p.i2cEnabled   = jsonGetBool(json, "i2c_enabled",     p.i2cEnabled);
    p.i2cSdaPin    = (int8_t)jsonGetInt(json, "i2c_sda",  p.i2cSdaPin);
    p.i2cSclPin    = (int8_t)jsonGetInt(json, "i2c_scl",  p.i2cSclPin);

    p.ethEnabled   = jsonGetBool(json, "eth_enabled",     p.ethEnabled);
    p.ethSckPin    = (int8_t)jsonGetInt(json, "eth_sck",  p.ethSckPin);
    p.ethMisoPin   = (int8_t)jsonGetInt(json, "eth_miso", p.ethMisoPin);
    p.ethMosiPin   = (int8_t)jsonGetInt(json, "eth_mosi", p.ethMosiPin);
    p.ethCsPin     = (int8_t)jsonGetInt(json, "eth_cs",   p.ethCsPin);
    p.ethIrqPin    = (int8_t)jsonGetInt(json, "eth_irq",  p.ethIrqPin);
    p.ethRstPin    = (int8_t)jsonGetInt(json, "eth_rst",  p.ethRstPin);
    p.ethSpiMhz    = (uint8_t)jsonGetInt(json, "eth_spi_mhz", p.ethSpiMhz);

    bool ok =
        readList(json, "buttons", HW_MAX_BUTTONS, p.buttonCount, p.buttons,
                 [](HwButton& b, const String& e) {
                     copyName(b.name, jsonGetString(e, "name"));
                     b.pin     = (int8_t)jsonGetInt(e, "pin", -1);
                     b.trigger = (uint8_t)jsonGetInt(e, "trigger", HW_PRESS_COUNT);
                 }, error) &&
        readList(json, "leds", HW_MAX_LEDS, p.ledCount, p.leds,
                 [](HwLed& l, const String& e) {
                     copyName(l.name, jsonGetString(e, "name"));
                     l.pin       = (int8_t)jsonGetInt(e, "pin", -1);
                     l.kind      = (uint8_t)jsonGetInt(e, "kind", HW_LED_KIND_COUNT);
                     l.activeLow = jsonGetBool(e, "active_low", false);
                     l.rgbType   = (uint8_t)jsonGetInt(e, "rgb_type", HW_RGB_WS2812);
                     l.rgbIndex  = (uint8_t)jsonGetInt(e, "rgb_index", 0);
                 }, error) &&
        readList(json, "button_assign", HW_MAX_BTN_ASSIGN, p.btnAssignCount, p.btnAssign,
                 [](HwAssignment& a, const String& e) {
                     copyName(a.target, jsonGetString(e, "target"));
                     a.function = (uint8_t)jsonGetInt(e, "function", HW_BTNF_COUNT);
                 }, error) &&
        readList(json, "led_assign", HW_MAX_LED_ASSIGN, p.ledAssignCount, p.ledAssign,
                 [](HwLedAssignment& a, const String& e) {
                     copyName(a.target, jsonGetString(e, "target"));
                     a.condition = (uint8_t)jsonGetInt(e, "condition", HW_COND_COUNT);
                     a.colour    = (uint8_t)jsonGetInt(e, "colour", HW_COL_COUNT);
                     a.pattern   = (uint8_t)jsonGetInt(e, "pattern", HW_PAT_COUNT);
                 }, error);

    if (!ok)
    {
        return false;
    }

    if (!validate(p, error))
    {
        return false;
    }

    store(p);
    Serial.println("HW: new profile stored, reboot to activate");
    return true;
}

String HwConfig::profileToJson(const HwProfile& p)
{
    String j = "{";
    j += "\"knx_uart\":" + String(p.knxUartNum) + ",";
    j += "\"knx_rx\":" + String(p.knxRxPin) + ",";
    j += "\"knx_tx\":" + String(p.knxTxPin) + ",";

    // Names passed validate(), so they hold nothing that needs escaping.
    // jsonEscape() runs anyway - the day someone adds a way in that skips
    // validation, the output should still be a document rather than a hole.
    j += "\"buttons\":[";
    for (uint8_t i = 0; i < p.buttonCount && i < HW_MAX_BUTTONS; i++)
    {
        if (i) j += ",";
        j += "{\"name\":\"" + jsonEscape(p.buttons[i].name) + "\"";
        j += ",\"pin\":" + String(p.buttons[i].pin);
        j += ",\"trigger\":" + String(p.buttons[i].trigger) + "}";
    }
    j += "],\"leds\":[";
    for (uint8_t i = 0; i < p.ledCount && i < HW_MAX_LEDS; i++)
    {
        if (i) j += ",";
        j += "{\"name\":\"" + jsonEscape(p.leds[i].name) + "\"";
        j += ",\"pin\":" + String(p.leds[i].pin);
        j += ",\"kind\":" + String(p.leds[i].kind);
        j += ",\"active_low\":" + String(p.leds[i].activeLow ? "true" : "false");
        j += ",\"rgb_type\":" + String(p.leds[i].rgbType);
        j += ",\"rgb_index\":" + String(p.leds[i].rgbIndex) + "}";
    }
    j += "],\"button_assign\":[";
    for (uint8_t i = 0; i < p.btnAssignCount && i < HW_MAX_BTN_ASSIGN; i++)
    {
        if (i) j += ",";
        j += "{\"target\":\"" + jsonEscape(p.btnAssign[i].target) + "\"";
        j += ",\"function\":" + String(p.btnAssign[i].function) + "}";
    }
    j += "],\"led_assign\":[";
    for (uint8_t i = 0; i < p.ledAssignCount && i < HW_MAX_LED_ASSIGN; i++)
    {
        if (i) j += ",";
        j += "{\"target\":\"" + jsonEscape(p.ledAssign[i].target) + "\"";
        j += ",\"condition\":" + String(p.ledAssign[i].condition);
        j += ",\"colour\":" + String(p.ledAssign[i].colour);
        j += ",\"pattern\":" + String(p.ledAssign[i].pattern) + "}";
    }
    j += "],";

    j += "\"i2c_enabled\":" + String(p.i2cEnabled ? "true" : "false") + ",";
    j += "\"i2c_sda\":" + String(p.i2cSdaPin) + ",";
    j += "\"i2c_scl\":" + String(p.i2cSclPin) + ",";
    j += "\"eth_enabled\":" + String(p.ethEnabled ? "true" : "false") + ",";
    j += "\"eth_sck\":" + String(p.ethSckPin) + ",";
    j += "\"eth_miso\":" + String(p.ethMisoPin) + ",";
    j += "\"eth_mosi\":" + String(p.ethMosiPin) + ",";
    j += "\"eth_cs\":" + String(p.ethCsPin) + ",";
    j += "\"eth_irq\":" + String(p.ethIrqPin) + ",";
    j += "\"eth_rst\":" + String(p.ethRstPin) + ",";
    j += "\"eth_spi_mhz\":" + String(p.ethSpiMhz);
    j += "}";
    return j;
}

String HwConfig::toJson() const
{
    String j = "{";
    j += "\"active\":" + profileToJson(_active) + ",";
    j += "\"stored\":" + profileToJson(_stored) + ",";
    j += "\"defaults\":" + profileToJson(defaults()) + ",";
    j += "\"has_stored\":" + String(_hasStored ? "true" : "false") + ",";
    j += "\"using_defaults\":" + String(usingDefaults() ? "true" : "false") + ",";
    j += "\"fallback\":\"" + String(fallbackReason()) + "\",";
    j += "\"reboot_pending\":" + String(_rebootPending ? "true" : "false") + ",";
    j += "\"chip\":\"" + String(ESP.getChipModel()) + "\",";
    j += "\"gpio_count\":" + String(SOC_GPIO_PIN_COUNT) + ",";
    j += "\"uart_count\":" + String(SOC_UART_NUM) + ",";

    /*
     * The pins a button or an LED may actually use.
     *
     * Sent so the dashboard can offer a list instead of a free number field.
     * The firmware still checks everything it is given - this only keeps the
     * user from picking something that was never going to be accepted.
     */
    j += "\"gpio_in\":[";
    bool first = true;
    for (int pin = 0; pin < SOC_GPIO_PIN_COUNT; pin++)
    {
        if (!pinUsable((int8_t)pin, false)) continue;
        if (!first) j += ",";
        j += String(pin);
        first = false;
    }
    j += "],\"gpio_out\":[";
    first = true;
    for (int pin = 0; pin < SOC_GPIO_PIN_COUNT; pin++)
    {
        if (!pinUsable((int8_t)pin, true)) continue;
        if (!first) j += ",";
        j += String(pin);
        first = false;
    }
    j += "]";
    j += "}";
    return j;
}
